---
kind: property
id: P:Autodesk.Revit.DB.Visual.Generic.GenericRefractionTranslucencyWeight
source: html/af49ca84-2aac-acb7-4af0-bd47e06e5e3f.htm
---
# Autodesk.Revit.DB.Visual.Generic.GenericRefractionTranslucencyWeight Property

The property labeled "Translucency" from the "Generic" schema.

## Syntax (C#)
```csharp
public static string GenericRefractionTranslucencyWeight { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 1".
 This property allows a connected asset.